app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "fashion"], ["created_at", "2020-08-18 18:10:24.033960"], ["updated_at", "2020-08-18 18:10:24.033960"]]