app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "i phone11"], ["description", "expensive cool device"], ["price", "200.0"], ["created_at", "2020-09-02 21:40:06.169594"], ["updated_at", "2020-09-02 21:40:06.169594"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 3], ["category_id", 1], ["created_at", "2020-09-02 21:40:06.479281"], ["updated_at", "2020-09-02 21:40:06.479281"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save
      @category_array = params.dig(:product, :category_ids)
      @category_array.each do |cat|
        @category = Category.find(cat)
        @product.categories << @category

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "i phone11"], ["updated_at", "2020-08-18 19:27:48.877755"], ["id", 1]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = $1  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["category_id", 1], ["created_at", "2020-08-18 19:29:55.178186"], ["updated_at", "2020-08-18 19:29:55.178186"]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
      @product.product_categories.destroy_all
      @category_array = params.dig(:product, :category_ids)
      @category_array.each do |cat|
        @category = Category.find(cat)
        @product.categories << @category

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    @product = Product.destroy(params[:id])