app/views/admin/products/edit.html.erb

  <%= f.input :description %>
  <%= f.association :categories, collection: Category.all, as: :check_boxes, include_hidden: false%>
---
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1  [["product_id", 1]]