app/views/admin/products/new.html.erb

SELECT "categories".* FROM "categories"
---
  <%= f.input :description %>
  <%= f.association :categories, collection: Category.all, as: :check_boxes, include_hidden: false%>