app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 1]]
---
  def show
    @category = Category.find(params[:id])
    @products = @category.products.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "tech"], ["created_at", "2020-08-07 22:55:41.473965"], ["updated_at", "2020-08-07 22:55:41.473965"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save