app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "i phone"], ["description", "tech"], ["price", "100.0"], ["created_at", "2020-08-07 22:49:36.192090"], ["updated_at", "2020-08-07 22:49:36.192090"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save