app/views/layouts/application.html.erb

        <%= link_to 'Home', products_path %>
        <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"